[
    {
      "companyName": "Jumeirah",
      "logo": "/jumeirah.png", 
      "timeSpan": "Remote | Apr ‘22 - Present",
      "points": [
        "Utilized React for frontend development and Node.js with Express for backend services with MongoDb as Database, leveraging AWS Lambda and Amazon Cognito for authentication, along with AWS S3 for scalable storage solutions.",
        "Improved website performance metrics by 23%, which led to a 12% decrease in bounce rates, resulting in a greater number of customers reaching our funnel.",
        "Developed an Azure Function to handle 3 million requests for a booking-related service, ensuring high availability and scalability and significantly reducing API response times.",
        "Integrated multiple payment solutions, including Stripe, Apple Pay, and Freedom Pay, for secure and seamless transactions across diverse projects.",
        "Collaborated with cross-functional teams, effectively communicating technical details and project requirements."
      ]
    },
    {
      "companyName": "Digikull",
      "logo": "/jumeirah.png", 
      "timeSpan": "Full Stack Developer",
      "points": [
        "Integrated real-time notifications via Socket.io to enhance user engagement during course purchases and class scheduling.",
        "Implemented Google OAuth for streamlined user login and improved user experience.",
        "Managed secure payment solutions with Stripe for seamless transactions.",
        "Synchronized event scheduling with Google Calendar to keep backend event management aligned with user calendars."
      ]
    },
    {
      "companyName": "Chiku",
      "logo": "/jumeirah.png", 
      "timeSpan": "Software Engineer | Pune | Aug ‘21 - Apr ‘22",
      "points": [
        "Replicated a community platform from a React Native app to a web interface using React and Redux, enhancing accessibility and user engagement.",
        "Integrated various third-party libraries and REST APIs to extend the platform's functionality.",
        "Optimized server-side rendering for better SEO and faster page loading times, improving the overall user experience.",
        "Utilized Google Lighthouse for performance audits and conducted A/B testing to optimize frontend website performance and user experience."
      ]
    }
  ]