[
  {
    "companyName": "Latitude Techno Labs",
    "title":"Full stack Developer",
    "logo": "/jumeirah.png",
    "timeSpan": "Remote | Apr '22 - Present",
    "points": [
      "Utilized React for frontend development and Node.js with Express for backend services, with MongoDB as the database, leveraging AWS Lambda and Amazon Cognito for authentication, along with AWS S3 for scalable storage solutions.",
      "Improved website performance metrics by 23%, leading to a 12% decrease in bounce rates, resulting in a greater number of customers reaching our funnel.",
      "Developed an Azure Function to handle 3 million requests for a booking-related service, ensuring high availability and scalability, and significantly reducing API response times.",
      "Integrated multiple third-party services, including Sitecore CMS, Synxis booking engine, Google Tag Manager, and Apple Pay, for a seamless user experience across diverse client projects.",
      "Reduced API response time from 1 second to 0.02 seconds, ensuring scalability under heavy traffic loads.",
      "Collaborated with cross-functional teams, effectively communicating technical details and project requirements."
    ]
  },
  {
    "companyName": "Chiku",
    "title":"Frontend Developer",
    "logo": "/jumeirah.png",
    "timeSpan": "Software Engineer | Pune | Aug '20 - Mar '22",
    "points": [
      "Spearheaded the development of a cutting-edge user interface using React, resulting in a 14% growth in website traffic.",
      "Replicated a community platform from a React Native app to a web interface using React and Redux, enhancing accessibility and user engagement.",
      "Integrated various third-party libraries and REST APIs to extend the platform's functionality.",
      "Optimized server-side rendering for better SEO and faster page loading times, improving the overall user experience.",
      "Utilized Google Lighthouse for performance audits and conducted A/B testing to optimize frontend website performance and user experience."
    ]
  }
]
